# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

cask "raycast"
cask "google-chrome"

cask "1password"
cask "arc"
cask "visual-studio-code"
cask "warp"
cask "discord"
cask "google-chrome"
cask "cron"
cask "todoist"
cask "linear-linear"
cask "grammarly"
cask "whatsapp"
cask "docker"
cask "figma"
cask "signal"
cask "telegram"
cask "firefox"
cask "ngrok"
cask "zoom"
cask "android-studio"
cask "notion"
cask "tableplus"
cask "brave-browser"
cask "shottr"
cask "runjs"
cask "cleanshot"
cask "mongodb-compass"
# cask "blender"

tap "oven-sh/bun"
brew "bun"
tap "supabase/tap"
# Install
# brew "supabase"
brew "ansible"
brew "sqlite"
brew "cocoapods"
brew "gh"
brew "nvm"
brew "python@3.11"
brew "htop"
brew "jq"
brew "xz"
brew "tmate"
brew "mas"
brew "httpie"
brew "httpstat"
brew "gping"
brew "tree"
brew "vim"
brew "vercel-cli"
brew "neovim"
# brew link "vim"

brew "withgraphite/tap/graphite"

# mas '1Password', id: 1333542190
# mas '1Password', id: 1333542190
# mas 'Slack', id: 803453959

# tap "tamagui/unistack"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "ban.spellright"
vscode "bierner.folder-source-actions"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "biomejs.biome"
vscode "ms-python.python"
# Get private repo
# vscode "calebporzio.simple-project-switcher"
vscode "Chad.nord-operator-theme"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "gimenete.github-linker"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "Graphite.gti-vscode"
vscode "johnpapa.vscode-peacock"
vscode "mattpocock.ts-error-translator"
vscode "mdixon18.palenight"
vscode "meganrogge.template-string-converter"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-typescript-next"
vscode "Orta.vscode-jest"
vscode "Orta.vscode-twoslash-queries"
vscode "rebornix.toggle"
vscode "rust-lang.rust-analyzer"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "sysoev.vscode-open-in-github"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "whizkydee.material-palenight-theme"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zixuanchen.vitest-explorer"
vscode "this-fifo.natty"
vscode "drcika.apc-extension"
vscode "graphite.gti-vscode"



# # 'brew tap'
# tap "homebrew/cask"
# # 'brew tap' with custom Git URL
# tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git"
# # 'brew tap' with arguments
# tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git", force_auto_update: true
